local function KtTwet(msg)
local text = msg.content_.text_
if ChatType == 'sp' or ChatType == 'gp'  then
if text == 'كت تويت' and ChCheck(msg) or text == 'كت' and ChCheck(msg) or text == 'تويت' and ChCheck(msg) or text == '⧴ كت ✫' and ChCheck(msg) then
if not DevHmD:get(DevTwix..'HmD:Lock:Games'..msg.chat_id_) then
local DevTwixTeam = {'تجامل الناس ولا اللي بقلبك على لسانك؟','مع او ضد سب البنت للدفاع عن نفسها.؟','‏- ألوانك المفضّلة؟','شخصيتك اجتماعيه ولا منعزله؟','كيف تعرفت على أقرب أصحابك ؟','مصروفك كم؟','أمنية كنت تتمناها وحققتها ؟','‏هل توافق على أن الإعجاب هو التوأم الوسيم للحب؟','تستغل وقت فراغك ب ايش ؟','تحب العلاقات العاطفيه ولا الصداقه؟','العِيون نصف الجمال مع,ضد ؟','تبادل الكراهية بالكراهية؟ ولا تحرجه بالطيب؟','تقطع علاقتك بالشخص إذا عرفت إنه...؟','حسيت انك ظلمت شخص.؟','تــاگ لــ¹⁴ گوله اسألــني ســؤال؟','تــاگ لــ¹¹ گوله لو خيــروک تنكــتم ساعه لو تغــادر يــوم²⁴ ؟','تــاگ لــ¹⁰ گوله لــو خيــروک بيني وبين الكــروب شنو تخــتار؟','تــاگ لــ⁵ گوله شنو أكثــر شي تحــبه بيه؟','تــاگ لــ3 أعضــاء گولهم اکرهــــکم','تــاگ لــ⁸ گوله اليــوم معــزوم يمي؟','تــاگ لــ⁶ گوله ممكن تدخــل گلبي؟','تــاگ لــ⁹ گوله شنــو اســم حبيبک/چ؟','تــاگ لــ⁷ گوله وين طامــس ودتزحف؟','تــاگ لــ³ گوله ليــش مكروه؟','تــاگ‌ لــ² گوله اني احبــک؟','تاگ لـ⁴ گوله انت ليش حلو؟','تاگ لـ أكثر واحد محبوب؟','تاگ لـ أكثر واحد نفسيه؟'}  
Dev_HmD(msg.chat_id_, msg.id_, 1,'*"..DevTwixTeam[math.random(#DevTwixTeam)].."*', 1, 'md')  
return false
end
end
end

end
return {
DevTwix = KtTwet
}
